Revit 2027 API
ACAObjectPreference Enumeration
 An enumerated type listing possible ways to generate geometry of an ACA object Revit object parameters used to generate geometry of the exported ACA object. Revit object geometry is used to generate geometry of the exported ACA object. That may produce better geometric fidelity in some cases.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ACAObjectPreference
Public Enumeration ACAObjectPreference
public enum class ACAObjectPreference
type ACAObjectPreference
Members
Member name | Value | Description
Geometry | 1
Object | 0
See Also
Reference
Autodesk.Revit.DB Namespace